# data frames

In [2]:
import numpy as np
import pandas as pd

In [3]:
import numpy.random as randn

In [21]:
np.random.seed(101) #The random number generator can be seeded so that it always starts with same set of "random" numbers

In [4]:
df = pd.DataFrame(randn.randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [5]:
df #df is list of columns, W X Y and Z are panda series with ABCDE as index

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [6]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [11]:
type(df['W'])

pandas.core.series.Series

In [12]:
type(df)

pandas.core.frame.DataFrame

In [13]:
# return set of columns from the data frame
df[['W','Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [14]:
df['new'] = df['W'] + df['Y'] # adding new series in the data frame

In [15]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [17]:
df.drop('A')

          W         X         Y         Z       new
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [26]:
df.drop('new',axis=1) 
# by default axis is 0, it will drop the row 'new' which is not there
# if axis=1, it will drop column 'new' (series)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [27]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [29]:
df.drop('new',axis=1,inplace=True)
# inplace will modify the object

In [30]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [31]:
 df.shape

(5, 4)

In [32]:
# selecting rows
df.loc['A']
# row is returned as series

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [33]:
df.iloc[0] #numerical index

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [34]:
df.loc['B','Y']
# value at row B and column Y

-0.84807698340363147

In [35]:
df.loc[['A','B'],['W','Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

## conditional selection and multiple indexing

In [36]:
df > 0

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [37]:
booldf = df >0

In [38]:
df[booldf]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [39]:
df[df>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [40]:
df['W']>0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [41]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [42]:
df[df['W']>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [43]:
df[df['Z']<0]

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

In [44]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [45]:
resultdf = df[df['W']>0]

In [48]:
resultdf

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [46]:
resultdf['X']

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [47]:
df[df['W']>0]['X']

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [53]:
# throws errors as and operator treats series as ambiguous
df[(df['W']>0) and (df['Y']>1)]

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [55]:
# use & instead of AND
# use | instead of OR
df[(df['W']>0) & (df['Y']>1)]

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [56]:
df[(df['W']>0) | (df['Y']>1)]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [57]:
df.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [58]:
newIndex = 'CA NY WY OR CO'.split()

In [59]:
newIndex

['CA', 'NY', 'WY', 'OR', 'CO']

In [60]:
df['states'] = newIndex

In [61]:
df

          W         X         Y         Z states
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [62]:
# set index in your dataframe
df.set_index('states')

               W         X         Y         Z
states
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

 ## multi-index and index hierarchy

In [22]:
# index levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [23]:
outside #list

['G1', 'G1', 'G1', 'G2', 'G2', 'G2']

In [24]:
inside

[1, 2, 3, 1, 2, 3]

In [25]:
hier_index

MultiIndex(levels=[['G1', 'G2'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [26]:
list(zip(outside,inside))
# list of tuple pairs

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [27]:
pd.MultiIndex.from_tuples(hier_index)
# creates multi levels indices from the list of tuples

MultiIndex(levels=[['G1', 'G2'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [28]:
df = pd.DataFrame(randn.randn(6,2),hier_index,['A','B'])

In [29]:
df

             A         B
G1 1  2.706850  0.628133
   2  0.907969  0.503826
   3  0.651118 -0.319318
G2 1 -0.848077  0.605965
   2 -2.018168  0.740122
   3  0.528813 -0.589001

In [30]:
df.loc['G1']

          A         B
1  2.706850  0.628133
2  0.907969  0.503826
3  0.651118 -0.319318

In [32]:
df.loc['G1'].loc[1]

A    2.706850
B    0.628133
Name: 1, dtype: float64

In [35]:
df.index.names = ['Groups','num']
#changes the names of the indexes

In [34]:
df

                   A         B
Groups num
G1     1    2.706850  0.628133
       2    0.907969  0.503826
       3    0.651118 -0.319318
G2     1   -0.848077  0.605965
       2   -2.018168  0.740122
       3    0.528813 -0.589001

In [36]:
df.loc['G2'].loc[2]['B']

0.74012205705610679

In [37]:
df.loc['G1'].loc[3]['A']

0.6511179479432686

In [38]:
#cross section of rows or columns
df.xs('G1')

            A         B
num
1    2.706850  0.628133
2    0.907969  0.503826
3    0.651118 -0.319318

In [39]:
df.xs(1,level='num') #returns g1 and g2 with inner index 1

               A         B
Groups
G1      2.706850  0.628133
G2     -0.848077  0.605965

## Pandas - Missing values

In [4]:
d = {'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}

In [5]:
dfm = pd.DataFrame(d)

In [6]:
dfm

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [8]:
dfm.dropna()

     A    B  C
0  1.0  5.0  1

In [10]:
dfm.dropna(axis=1)

   C
0  1
1  2
2  3

In [12]:
dfm.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [14]:
dfm.dropna(thresh=3)

     A    B  C
0  1.0  5.0  1

In [16]:
dfm

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [17]:
df = dfm

In [18]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [19]:
df.fillna(value='filler')

        A       B  C
0       1       5  1
1       2  filler  2
2  filler  filler  3

In [20]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

## groupBy

In [21]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [22]:
df = pd.DataFrame(data)

In [23]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [25]:
comp = df.groupby('Company')

In [27]:
comp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [28]:
comp.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [31]:
comp.sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [32]:
df.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

## Merging, joining and concat

In [33]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

In [34]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7])

In [35]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [36]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [37]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [38]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [39]:
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [40]:
pd.concat([df1,df2,df3],axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [41]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [42]:
left

    A   B key
0  A0  B0  K0
1  A1  B1  K1
2  A2  B2  K2
3  A3  B3  K3

In [43]:
right

    C   D key
0  C0  D0  K0
1  C1  D1  K1
2  C2  D2  K2
3  C3  D3  K3

In [44]:
pd.merge(left,right,how='inner',on='key')

    A   B key   C   D
0  A0  B0  K0  C0  D0
1  A1  B1  K1  C1  D1
2  A2  B2  K2  C2  D2
3  A3  B3  K3  C3  D3

In [45]:

left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [46]:
pd.merge(left, right, on=['key1', 'key2'])

    A   B key1 key2   C   D
0  A0  B0   K0   K0  C0  D0
1  A2  B2   K1   K0  C1  D1
2  A2  B2   K1   K0  C2  D2

In [47]:
pd.merge(left, right, how='right', on=['key1', 'key2'])

     A    B key1 key2   C   D
0   A0   B0   K0   K0  C0  D0
1   A2   B2   K1   K0  C1  D1
2   A2   B2   K1   K0  C2  D2
3  NaN  NaN   K2   K0  C3  D3

In [48]:
pd.merge(left, right, how='left', on=['key1', 'key2'])

    A   B key1 key2    C    D
0  A0  B0   K0   K0   C0   D0
1  A1  B1   K0   K1  NaN  NaN
2  A2  B2   K1   K0   C1   D1
3  A2  B2   K1   K0   C2   D2
4  A3  B3   K2   K1  NaN  NaN

## Joining

In [49]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [50]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [52]:
left.join(right,how='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

## operations

In [69]:
import pandas as pd
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [70]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [71]:
df['col2'].nunique()

3

In [72]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [73]:
def times2(x):
    return x*2

In [74]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [75]:
df['col2'].apply(lambda x:x*2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [76]:
df.drop('col1',axis=1)

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [77]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [79]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [80]:
df.sort_values('col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [81]:
df.sort_values('col3')

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [82]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}
df = pd.DataFrame(data)
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [83]:
df.pivot_table(values='D', index=['A','B'],columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

## Input and output into python

In [84]:
import pandas as pd

In [85]:
df = pd.read_csv('example')
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [88]:
df = pd.read_csv('example')
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [89]:
df.to_csv('my_output')

In [92]:
pd.read_csv('my_output') #old index is persistent

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [93]:
df.to_csv('my_output', index=False) #does not save old index

In [94]:
pd.read_csv('my_output')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [95]:
pd.read_excel('Excel_Sample.xlsx',sheetname='Sheet1')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [99]:
df.to_excel('Excel_Sample2.xlsx',sheet_name='NewSheet')

In [100]:
df = pd.read_html('http://www.fdic.gov/bank/individual/failed/banklist.html')

In [101]:
df

[                                             Bank Name                City  \
 0                                  Fayette County Bank          Saint Elmo
 1    Guaranty Bank, (d/b/a BestBank in Georgia & Mi...           Milwaukee
 2                                       First NBC Bank         New Orleans
 3                                        Proficio Bank  Cottonwood Heights
 4                        Seaway Bank and Trust Company             Chicago
 5                               Harvest Community Bank          Pennsville
 6                                          Allied Bank            Mulberry
 7                         The Woodbury Banking Company            Woodbury
 8                               First CornerStone Bank     King of Prussia
 9                                   Trust Company Bank             Memphis
 10                          North Milwaukee State Bank           Milwaukee
 11                              Hometown National Bank            Longview
 12                                 The Bank of Georgia      Peachtree City
 13                                        Premier Bank              Denver
 14                                      Edgebrook Bank             Chicago
 15                              Doral Bank  En Espanol            San Juan
 16                   Capitol City Bank & Trust Company             Atlanta
 17                             Highland Community Bank             Chicago
 18                    First National Bank of Crestview           Crestview
 19                                  Northern Star Bank             Mankato
 20              Frontier Bank, FSB D/B/A El Paseo Bank         Palm Desert
 21               The National Republic Bank of Chicago             Chicago
 22                                      NBRS Financial          Rising Sun
 23                               GreenChoice Bank, fsb             Chicago
 24                            Eastside Commercial Bank             Conyers
 25                              The Freedom State Bank             Freedom
 26                                         Valley Bank     Fort Lauderdale
 27                                         Valley Bank              Moline
 28                         Slavie Federal Savings Bank             Bel Air
 29                               Columbia Savings Bank          Cincinnati
 ..                                                 ...                 ...
 523                                  ANB Financial, NA         Bentonville
 524                                          Hume Bank                Hume
 525                             Douglass National Bank         Kansas City
 526                                  Miami Valley Bank            Lakeview
 527                                            NetBank          Alpharetta
 528                          Metropolitan Savings Bank          Pittsburgh
 529                                    Bank of Ephraim             Ephraim
 530                                      Reliance Bank        White Plains
 531              Guaranty National Bank of Tallahassee         Tallahassee
 532                                Dollar Savings Bank              Newark
 533                               Pulaski Savings Bank        Philadelphia
 534              First National Bank of Blanchardville      Blanchardville
 535                              Southern Pacific Bank            Torrance
 536                        Farmers Bank of Cheneyville         Cheneyville
 537                                      Bank of Alamo               Alamo
 538             AmTrade International Bank  En Espanol             Atlanta
 539                     Universal Federal Savings Bank             Chicago
 540                       Connecticut Bank of Commerce            Stamford
 541                                   New Century Bank     Shelby Township
 542                              Net 1st National Bank          Boca Raton
 543                                       NextBank, NA             Phoenix
 544                           Oakwood Deposit Bank Co.             Oakwood
 545                              Bank of Sierra Blanca       Sierra Blanca
 546                      Hamilton Bank, NA  En Espanol               Miami
 547                             Sinclair National Bank            Gravette
 548                                 Superior Bank, FSB            Hinsdale
 549                                Malta National Bank               Malta
 550                    First Alliance Bank & Trust Co.          Manchester
 551                  National State Bank of Metropolis          Metropolis
 552                                   Bank of Honolulu            Honolulu

      ST   CERT                Acquiring Institution        Closing Date  \
 0    IL   1802            United Fidelity Bank, fsb        May 26, 2017
 1    WI  30003  First-Citizens Bank & Trust Company         May 5, 2017
 2    LA  58302                         Whitney Bank      April 28, 2017
 3    UT  35495                    Cache Valley Bank       March 3, 2017
 4    IL  19328                  State Bank of Texas    January 27, 2017
 5    NJ  34951  First-Citizens Bank & Trust Company    January 13, 2017
 6    AR     91                         Today's Bank  September 23, 2016
 7    GA  11297                          United Bank     August 19, 2016
 8    PA  35312  First-Citizens Bank & Trust Company         May 6, 2016
 9    TN   9956           The Bank of Fayette County      April 29, 2016
 10   WI  20364  First-Citizens Bank & Trust Company      March 11, 2016
 11   WA  35156                       Twin City Bank     October 2, 2015
 12   GA  35259                        Fidelity Bank     October 2, 2015
 13   CO  34112            United Fidelity Bank, fsb       July 10, 2015
 14   IL  57772             Republic Bank of Chicago         May 8, 2015
 15   PR  32102         Banco Popular de Puerto Rico   February 27, 2015
 16   GA  33938  First-Citizens Bank & Trust Company   February 13, 2015
 17   IL  20290            United Fidelity Bank, fsb    January 23, 2015
 18   FL  17557                       First NBC Bank    January 16, 2015
 19   MN  34983                            BankVista   December 19, 2014
 20   CA  34738    Bank of Southern California, N.A.    November 7, 2014
 21   IL    916                  State Bank of Texas    October 24, 2014
 22   MD   4862                          Howard Bank    October 17, 2014
 23   IL  28462                 Providence Bank, LLC       July 25, 2014
 24   GA  58125            Community & Southern Bank       July 18, 2014
 25   OK  12483      Alva State Bank & Trust Company       June 27, 2014
 26   FL  21793  Landmark Bank, National Association       June 20, 2014
 27   IL  10450                  Great Southern Bank       June 20, 2014
 28   MD  32368                        Bay Bank, FSB        May 30, 2014
 29   OH  32284            United Fidelity Bank, fsb        May 23, 2014
 ..   ..    ...                                  ...                 ...
 523  AR  33901       Pulaski Bank and Trust Company         May 9, 2008
 524  MO   1971                        Security Bank       March 7, 2008
 525  MO  24660       Liberty Bank and Trust Company    January 25, 2008
 526  OH  16848         The Citizens Banking Company     October 4, 2007
 527  GA  32575                           ING DIRECT  September 28, 2007
 528  PA  35353  Allegheny Valley Bank of Pittsburgh    February 2, 2007
 529  UT   1249                        Far West Bank       June 25, 2004
 530  NY  26778                     Union State Bank      March 19, 2004
 531  FL  26838              Hancock Bank of Florida      March 12, 2004
 532  NJ  31330                          No Acquirer   February 14, 2004
 533  PA  27203                       Earthstar Bank   November 14, 2003
 534  WI  11639                        The Park Bank         May 9, 2003
 535  CA  27094                            Beal Bank    February 7, 2003
 536  LA  16445            Sabine State Bank & Trust   December 17, 2002
 537  TN   9961                          No Acquirer    November 8, 2002
 538  GA  33784                          No Acquirer  September 30, 2002
 539  IL  29355               Chicago Community Bank       June 27, 2002
 540  CT  19183                   Hudson United Bank       June 26, 2002
 541  MI  34979                          No Acquirer      March 28, 2002
 542  FL  26652                       Bank Leumi USA       March 1, 2002
 543  AZ  22314                          No Acquirer    February 7, 2002
 544  OH   8966       The State Bank & Trust Company    February 1, 2002
 545  TX  22002     The Security State Bank of Pecos    January 18, 2002
 546  FL  24382     Israel Discount Bank of New York    January 11, 2002
 547  AR  34248                   Delta Trust & Bank   September 7, 2001
 548  IL  32646                Superior Federal, FSB       July 27, 2001
 549  OH   6629                    North Valley Bank         May 3, 2001
 550  NH  34264  Southern New Hampshire Bank & Trust    February 2, 2001
 551  IL   3815              Banterra Bank of Marion   December 14, 2000
 552  HI  21029                   Bank of the Orient    October 13, 2000

            Updated Date
 0         July 26, 2017
 1         July 26, 2017
 2         July 26, 2017
 3          May 18, 2017
 4          May 18, 2017
 5          May 18, 2017
 6     November 17, 2016
 7          June 1, 2017
 8     September 6, 2016
 9     September 6, 2016
 10       March 13, 2017
 11       April 13, 2016
 12     October 24, 2016
 13      August 17, 2016
 14        July 12, 2016
 15         May 13, 2015
 16       April 21, 2015
 17       April 21, 2015
 18          May 8, 2017
 19      January 6, 2016
 20    November 10, 2016
 21      January 6, 2016
 22       March 26, 2015
 23    December 12, 2016
 24        July 11, 2016
 25       March 25, 2016
 26        June 29, 2015
 27        June 26, 2015
 28    December 12, 2016
 29    November 10, 2016
 ..                  ...
 523     August 28, 2012
 524     August 28, 2012
 525    October 26, 2012
 526  September 12, 2016
 527     August 28, 2012
 528    October 27, 2010
 529       April 9, 2008
 530       April 9, 2008
 531        June 5, 2012
 532       April 9, 2008
 533       July 22, 2005
 534        June 5, 2012
 535    October 20, 2008
 536    October 20, 2004
 537      March 18, 2005
 538  September 11, 2006
 539       April 9, 2008
 540   February 14, 2012
 541      March 18, 2005
 542       April 9, 2008
 543    February 5, 2015
 544    October 25, 2012
 545    November 6, 2003
 546  September 21, 2015
 547   February 10, 2004
 548     August 19, 2014
 549   November 18, 2002
 550   February 18, 2003
 551      March 17, 2005
 552      March 17, 2005

 [553 rows x 7 columns]]

In [103]:
type(df)

list

In [108]:
df[0].head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Fayette County Bank,Saint Elmo,IL,1802,"United Fidelity Bank, fsb","May 26, 2017","July 26, 2017"
1,"Guaranty Bank, (d/b/a BestBank in Georgia & Mi...",Milwaukee,WI,30003,First-Citizens Bank & Trust Company,"May 5, 2017","July 26, 2017"
2,First NBC Bank,New Orleans,LA,58302,Whitney Bank,"April 28, 2017","July 26, 2017"
3,Proficio Bank,Cottonwood Heights,UT,35495,Cache Valley Bank,"March 3, 2017","May 18, 2017"
4,Seaway Bank and Trust Company,Chicago,IL,19328,State Bank of Texas,"January 27, 2017","May 18, 2017"

## SQL

In [121]:
from sqlalchemy import create_engine
import numpy as np
import pandas as pd
df = pd.DataFrame()

In [122]:
engine = create_engine('sqlite:///:memory:')

In [123]:
my_table = pd.read_csv('my_output')
my_table

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [125]:
df.to_sql('my_table',engine)

In [126]:
sql_df = pd.read_sql('my_table',con=engine)